<a href="https://colab.research.google.com/github/Drey-Tee/SQL/blob/main/SQL_Study_Plan_I.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Leetcode 595**: Big Countries

**Description** : Table: World

+-------------+------------------+

| Column Name | Type    |

+-------------+-------------------+

| name        | varchar           |

| continent   | varchar           |

| area        | int               |

| population  | int               |

| gdp         | int               |

+-------------+-------------------+

name is the primary key column for this table.
Each row of this table gives information about the name of a country, the continent to which it belongs, its area, the population, and its GDP value.
A country is big if:

it has an area of at least three million (i.e., 3000000 km2), or

it has a population of at least twenty-five million (i.e., 25000000).

Write an SQL query to report the name, population, and area of the big countries.

Return the result table in any order.

**URL** : **https://leetcode.com/problems/big-countries/**

In [ ]:
# Write your MySQL query statement below
SELECT name, area, population
FROM World WHERE
area >= 3000000 OR population >= 25000000

**Leetcode 1757**: Recyclables and Low Fat Products

**Description** : Table: Products

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| product_id  | int     |

| low_fats    | enum    |

| recyclable  | enum    |

+-------------+---------+

product_id is the primary key for this table.
low_fats is an ENUM of type ('Y', 'N') where 'Y' means this product is low fat and 'N' means it is not.
recyclable is an ENUM of types ('Y', 'N') where 'Y' means this product is recyclable and 'N' means it is not.
 

Write an SQL query to find the ids of products that are both low fat and recyclable.

Return the result table in any order.

**URL** : **https://leetcode.com/problems/recyclable-and-low-fat-products/**

In [ ]:
# Write your MySQL query statement below
SELECT product_id
FROM Products 
WHERE
low_fats = 'Y' AND recyclable = 'Y'

**Leetcode 584**: Find Customer Referee

**Description** : Table: Customer

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| id          | int     |

| name        | varchar |

| referee_id  | int     |

+-------------+---------+

id is the primary key column for this table.
Each row of this table indicates the id of a customer, their name, and the id of the customer who referred them.
 

Write an SQL query to report the names of the customer that are not referred by the customer with id = 2.

Return the result table in any order.


**URL** : **https://leetcode.com/problems/find-customer-referee/**

In [ ]:
# Write your MySQL query statement below
SELECT name
FROM Customer
WHERE referee_id !=2 OR referee_id is NULL;

**Leetcode 183**: Customers Who Never Order

**Description** : Table: Customers

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| id          | int     |

| name        | varchar |

+-------------+---------+

id is the primary key column for this table.
Each row of this table indicates the ID and name of a customer.
 

Table: Orders

+-------------+------+

| Column Name | Type |

+-------------+------+

| id          | int  |

| customerId  | int  |

+-------------+------+

id is the primary key column for this table.
customerId is a foreign key of the ID from the Customers table.
Each row of this table indicates the ID of an order and the ID of the customer who ordered it.
 

Write an SQL query to report all customers who never order anything.

Return the result table in any order.


**URL** : **https://leetcode.com/problems/customers-who-never-order/**

In [ ]:
# Write your MySQL query statement below
SELECT name AS Customers 
FROM Customers 
WHERE id NOT IN (SELECT customerId FROM Orders)

**Leetcode 1873**: Calculate Special Bonus

**Description** : Table: Employees

+-------------+---------+


| Column Name | Type    |

+-------------+---------+

| employee_id | int     |


| name        | varchar |

| salary      | int     |

+-------------+---------+

employee_id is the primary key for this table.
Each row of this table indicates the employee ID, employee name, and salary.
 

Write an SQL query to calculate the bonus of each employee. The bonus of an employee is 100% of their salary if the ID of the employee is an odd number and the employee name does not start with the character 'M'. The bonus of an employee is 0 otherwise.

Return the result table ordered by employee_id.

**URL** : **https://leetcode.com/problems/calculate-special-bonus/**

In [ ]:
# Write your MySQL query statement below
SELECT employee_id, if(employee_id%2=1 AND name NOT LIKE 'm%', salary,0) AS bonus
FROM Employees ORDER BY employee_id;

**Leetcode 1873**: Swap Salary

**Description** : Table: Salary

+-------------+----------+

| Column Name | Type     |

+-------------+----------+

| id          | int      |

| name        | varchar  |

| sex         | ENUM     |

| salary      | int      |

+-------------+----------+

id is the primary key for this table.
The sex column is ENUM value of type ('m', 'f').
The table contains information about an employee.
 

Write an SQL query to swap all 'f' and 'm' values (i.e., change all 'f' values to 'm' and vice versa) with a single update statement and no intermediate temporary tables.

Note that you must write a single update statement, do not write any select statement for this problem.

**URL** : **https://leetcode.com/problems/swap-salary/**

In [ ]:
UPDATE Salary SET sex = CASE WHEN sex = 'f' THEN 'm' ELSE 'f' END

**Leetcode 196**: Delete Duplicate Emails

**Description** : Table: Person

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| id          | int     |

| email       | varchar |

+-------------+---------+

id is the primary key column for this table.

Each row of this table contains an email. The emails will not contain uppercase letters.
 

Write an SQL query to delete all the duplicate emails, keeping only one unique email with the smallest id. Note that you are supposed to write a DELETE statement and not a SELECT one.

After running your script, the answer shown is the Person table. The driver will first compile and run your piece of code and then show the Person table. The final order of the Person table does not matter.

**URL** : **https://leetcode.com/problems/delete-duplicate-emails/**

In [ ]:
# Please write a DELETE statement and DO NOT write a SELECT statement.
# Write your MySQL query statement below
DELETE tb1
FROM Person as tb1, Person as tb2
WHERE tb1.Email = tb2.Email AND tb1.Id > tb2.Id;

**Leetcode 1667**: Fix Names in a Table

**Description** : Table: Users

+----------------+---------+

| Column Name    | Type    |

+----------------+---------+

| user_id        | int     |

| name           | varchar |

+----------------+---------+

user_id is the primary key for this table.
This table contains the ID and the name of the user. The name consists of only lowercase and uppercase characters.
 

Write an SQL query to fix the names so that only the first character is uppercase and the rest are lowercase.

Return the result table ordered by user_id.

**URL** : **https://leetcode.com/problems/fix-names-in-a-table/**

In [ ]:
# Write your MySQL query statement below
SELECT user_id,
CONCAT(UCASE(LEFT(name,1)),LCASE(SUBSTRING(name,2))) as name
FROM Users ORDER BY user_id;

**Leetcode 1484**: Group Sold Products By Date

**Description** : Table Activities:

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| sell_date   | date    |

| product     | varchar |

+-------------+---------+

There is no primary key for this table, it may contain duplicates.
Each row of this table contains the product name and the date it was sold in a market.
 

Write an SQL query to find for each date the number of different products sold and their names.

The sold products names for each date should be sorted lexicographically.

Return the result table ordered by sell_date.

**URL** : **https://leetcode.com/problems/group-sold-products-by-the-date/**

In [ ]:
# Write your MySQL query statement below
SELECT sell_date,
		COUNT(DISTINCT(product)) AS num_sold, 
		GROUP_CONCAT(DISTINCT product ORDER BY product ASC) AS products
FROM Activities
GROUP BY sell_date
ORDER BY sell_date ASC

**Leetcode 1527**: Patients With a Condition

**Description** : Table: Patients

+--------------+---------+

| Column Name  | Type    |

+--------------+---------+

| patient_id   | int     |

| patient_name | varchar |

| conditions   | varchar |

+--------------+---------+

patient_id is the primary key for this table.
'conditions' contains 0 or more code separated by spaces. 
This table contains information of the patients in the hospital.
 

Write an SQL query to report the patient_id, patient_name all conditions of patients who have Type I Diabetes. Type I Diabetes always starts with DIAB1 prefix

Return the result table in any order.

**URL** : **https://leetcode.com/problems/patients-with-a-condition/**

In [ ]:
# Write your MySQL query statement below
SELECT *
FROM
    Patients
WHERE
    conditions LIKE 'DIAB1%'
    OR conditions LIKE '% DIAB1%'

**Leetcode 1965**: Employees With Missing Information

**Description** : Table: Employees

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| employee_id | int     |

| name        | varchar |

+-------------+---------+

employee_id is the primary key for this table.
Each row of this table indicates the name of the employee whose ID is employee_id.
 

Table: Salaries

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| employee_id | int     |

| salary      | int     |

+-------------+---------+

employee_id is the primary key for this table.
Each row of this table indicates the salary of the employee whose ID is employee_id.
 

Write an SQL query to report the IDs of all the employees with missing information. The information of an employee is missing if:

The employee's name is missing, or
The employee's salary is missing.
Return the result table ordered by employee_id in ascending order.

**URL** : **https://leetcode.com/problems/employees-with-missing-information/**

In [ ]:
# Write your MySQL query statement below
SELECT employee_id FROM Employees 
WHERE employee_id 
NOT IN (SELECT employee_id FROM Salaries )
UNION
SELECT employee_id FROM Salaries 
WHERE employee_id 
NOT IN (SELECT employee_id FROM Employees)
ORDER BY employee_id ASC

**Leetcode 1795**: Rearrange Products Table

**Description** : Table: Products

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| product_id  | int     |

| store1      | int     |

| store2      | int     |

| store3      | int     |

+-------------+---------+

product_id is the primary key for this table.
Each row in this table indicates the product's price in 3 different stores: store1, store2, and store3.
If the product is not available in a store, the price will be null in that store's column.
 

Write an SQL query to rearrange the Products table so that each row has (product_id, store, price). If a product is not available in a store, do not include a row with that product_id and store combination in the result table.

Return the result table in any order.

**URL** : **https://leetcode.com/problems/rearrange-products-table/**

In [ ]:
# Write your MySQL query statement below
SELECT product_id, 'store1' AS store , store1 AS price FROM products WHERE store1 IS NOT NULL 
UNION
SELECT product_id, 'store2' AS store , store2 AS price FROM products WHERE store2 IS NOT NULL 
UNION
SELECT product_id, 'store3' AS store , store3 AS price FROM products WHERE store3 IS NOT NULL;

**Leetcode 608**: Tree Node

**Description** : Table: Tree

+-------------+------+

| Column Name | Type |

+-------------+------+

| id          | int  |

| p_id        | int  |

+-------------+------+

id is the primary key column for this table.
Each row of this table contains information about the id of a node and the id of its parent node in a tree.
The given structure is always a valid tree.
 

Each node in the tree can be one of three types:

"Leaf": if the node is a leaf node.
"Root": if the node is the root of the tree.
"Inner": If the node is neither a leaf node nor a root node.
Write an SQL query to report the type of each node in the tree.

Return the result table ordered by id in ascending order.

**URL** : **https://leetcode.com/problems/tree-node/**

In [ ]:
# Write your MySQL query statement below
SELECT id, 
IF(p_id IS NULL, "Root", IF(id IN (SELECT DISTINCT p_id FROM Tree), "Inner", "Leaf")) 
AS type FROM Tree

**Leetcode 176**: Second Highest Salary

**Description** : Table: Employee

+-------------+------+

| Column Name | Type |

+-------------+------+

| id          | int  |

| salary      | int  |

+-------------+------+

id is the primary key column for this table.
Each row of this table contains information about the salary of an employee.
Write an SQL query to report the second highest salary from the Employee table. If there is no second highest salary, the query should report null.

**URL** : **https://leetcode.com/problems/second-highest-salary/**

In [ ]:
# Write your MySQL query statement below
SELECT MAX(salary) AS SecondHighestSalary
FROM Employee 
WHERE salary NOT IN (SELECT MAX(salary) 
                          FROM Employee);

**Leetcode 175**: Combine Two Tables

**Description** : Table: Person

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| personId    | int     |

| lastName    | varchar |

| firstName   | varchar |

+-------------+---------+

personId is the primary key column for this table.
This table contains information about the ID of some persons and their first and last names.
 

Table: Address

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| addressId   | int     |

| personId    | int     |

| city        | varchar |

| state       | varchar |

+-------------+---------+

addressId is the primary key column for this table.
Each row of this table contains information about the city and state of one person with ID = PersonId.
 

Write an SQL query to report the first name, last name, city, and state of each person in the Person table. If the address of a personId is not present in the Address table, report null instead.

Return the result table in any order.

**URL** : **https://leetcode.com/problems/combine-two-tables/**

In [ ]:
# Write your MySQL query statement below
SELECT Person.firstName, Person.lastName, Address.state, Address.city
FROM Person 
LEFT JOIN Address  
ON Person.personId = Address.personId

**Leetcode 1581**: Custome Who Visited But Did Not Make Any Transactions

**Description** : Table: Visits

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| visit_id    | int     |

| customer_id | int     |

+-------------+---------+

visit_id is the primary key for this table.
This table contains information about the customers who visited the mall.
 

Table: Transactions

+----------------+---------+

| Column Name    | Type    |

+----------------+---------+

| transaction_id | int     |

| visit_id       | int     |

| amount         | int     |

+----------------+---------+

transaction_id is the primary key for this table.
This table contains information about the transactions made during the visit_id.
 

Write an SQL query to find the IDs of the users who visited without making any transactions and the number of times they made these types of visits.

Return the result table sorted in any order.


**URL** : **https://leetcode.com/problems/customer-who-visited-but-did-not-make-any-transactions/**

In [ ]:
# Write your MySQL query statement below
SELECT customer_id, 
COUNT(customer_id) AS 'count_no_trans' 
FROM visits 
WHERE visit_id 
NOT IN(SELECT DISTINCT(visit_id) FROM Transactions ) 
GROUP BY customer_id;

**Leetcode 1148**: Article Views I

**Description** : Table: Views

+---------------+---------+

| Column Name   | Type    |

+---------------+---------+

| article_id    | int     |

| author_id     | int     |

| viewer_id     | int     |

| view_date     | date    |

+---------------+---------+

There is no primary key for this table, it may have duplicate rows.
Each row of this table indicates that some viewer viewed an article (written by some author) on some date. 
Note that equal author_id and viewer_id indicate the same person.
 

Write an SQL query to find all the authors that viewed at least one of their own articles.

Return the result table sorted by id in ascending order.


**URL** : **https://leetcode.com/problems/article-views-i/**

In [ ]:
# Write your MySQL query statement below
SELECT DISTINCT author_id as id 
FROM views 
WHERE author_id = viewer_id 
ORDER BY author_id;

**Leetcode 197**: Rising Temperature

**Description** : Table: Weather

+---------------+---------+

| Column Name   | Type    |

+---------------+---------+

| id            | int     |

| recordDate    | date    |

| temperature   | int     |

+---------------+---------+
id is the primary key for this table.
This table contains information about the temperature on a certain day.
 

Write an SQL query to find all dates' Id with higher temperatures compared to its previous dates (yesterday).

Return the result table in any order.


**URL** : **https://leetcode.com/problems/rising-temperature/**

In [ ]:
# Write your MySQL query statement below
SELECT w1.id FROM Weather w1, Weather w2
WHERE DATEDIFF(w1.recordDate,w2.recordDate)=1
AND w1.temperature>w2.temperature

**Leetcode 607**: Sales Person

**Description** : Table: SalesPerson

+-----------------+---------+

| Column Name     | Type    |

+-----------------+---------+

| sales_id        | int     |

| name            | varchar |

| salary          | int     |

| commission_rate | int     |

| hire_date       | date    |

+-----------------+---------+

sales_id is the primary key column for this table.
Each row of this table indicates the name and the ID of a salesperson alongside their salary, commission rate, and hire date.
 

Table: Company

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| com_id      | int     |

| name        | varchar |

| city        | varchar |

+-------------+---------+

com_id is the primary key column for this table.
Each row of this table indicates the name and the ID of a company and the city in which the company is located.
 

Table: Orders

+-------------+------+

| Column Name | Type |

+-------------+------+

| order_id    | int  |

| order_date  | date |

| com_id      | int  |

| sales_id    | int  |

| amount      | int  |

+-------------+------+

order_id is the primary key column for this table.
com_id is a foreign key to com_id from the Company table.
sales_id is a foreign key to sales_id from the SalesPerson table.
Each row of this table contains information about one order. This includes the ID of the company, the ID of the salesperson, the date of the order, and the amount paid.
 

Write an SQL query to report the names of all the salespersons who did not have any orders related to the company with the name "RED".

Return the result table in any order.

**URL** : **https://leetcode.com/problems/sales-person/**

In [ ]:
# Write your MySQL query statement below
SELECT DISTINCT name AS name FROM salesperson
WHERE sales_id NOT IN (
    SELECT DISTINCT(O.sales_id) FROM orders AS O 
    INNER JOIN company AS C ON O.com_id = C.com_id
    WHERE C.name = 'RED'
)

**Leetcode 1141**: User Activity For The Pasr 30 Days I

**Description** : Table: Activity

+---------------+---------+

| Column Name   | Type    |

+---------------+---------+

| user_id       | int     |

| session_id    | int     |

| activity_date | date    |

| activity_type | enum    |

+---------------+---------+

There is no primary key for this table, it may have duplicate rows.
The activity_type column is an ENUM of type ('open_session', 'end_session', 'scroll_down', 'send_message').
The table shows the user activities for a social media website. 
Note that each session belongs to exactly one user.
 

Write an SQL query to find the daily active user count for a period of 30 days ending 2019-07-27 inclusively. A user was active on someday if they made at least one activity on that day.

Return the result table in any order.


**URL** : https://leetcode.com/problems/user-activity-for-the-past-30-days-i/**

In [ ]:
# Write your MySQL query statement below
SELECT activity_date AS day, COUNT(distinct user_id) AS active_users
FROM Activity
WHERE activity_date BETWEEN '20190628' AND '20190727'
GROUP BY activity_date

**Leetcode 1693**: Daily Leads And Partners

**Description** : Table: DailySales

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| date_id     | date    |

| make_name   | varchar |

| lead_id     | int     |

| partner_id  | int     |

+-------------+---------+

This table does not have a primary key.
This table contains the date and the name of the product sold and the IDs of the lead and partner it was sold to.
The name consists of only lowercase English letters.
 

Write an SQL query that will, for each date_id and make_name, return the number of distinct lead_id's and distinct partner_id's.

Return the result table in any order.
**URL** : *https://leetcode.com/problems/daily-leads-and-partners/**

In [ ]:
# Write your MySQL query statement below
SELECT date_id,make_name, COUNT(DISTINCT lead_id) AS unique_leads, 
COUNT(DISTINCT partner_id) AS unique_partners
FROM DailySales
GROUP BY date_id,make_name;

**Leetcode 1729*: Find Followers Count

**Description** :Table: Followers

+-------------+------+

| Column Name | Type |

+-------------+------+

| user_id     | int  |

| follower_id | int  |

+-------------+------+

(user_id, follower_id) is the primary key for this table.
This table contains the IDs of a user and a follower in a social media app where the follower follows the user.
 

Write an SQL query that will, for each user, return the number of followers.

Return the result table ordered by user_id..


**URL** : **https://leetcode.com/problems/find-followers-count/**

In [ ]:
# Write your MySQL query statement below
SELECT user_id, COUNT(follower_id) AS followers_count
FROM Followers
GROUP BY user_id
ORDER BY user_id ASC